Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures.TypeSizeNotMatchWithHostError
The [Symbol] does not match the size of the host.

Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures.InstanceProfileNotMatchWithHostError
The [Symbol]'s profile does not match the host. Instances of [Symbol] will be deleted.

Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures.InstanceOutOfHostError
The instance of [Symbol] lost its host and will be deleted.

Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures.CannotMatchInstanceSizeToHostError
The instance of [Symbol] cannot be re-sized to match the host.

Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures
Failures about MEP suppor.